Repository: bigote/Tkabber-Wiki-Translation
Catalog: ru_en/tkabber-wiki-omegat.tmx
Source language: ru
Languages: en_us

source: === Windows, дистрибутив от ActiveState &mdash; "падения" при нажатии Alt-любая кнопка в главном окне ===
en_us: === Windows, ActiveState Tcl/Tk: Tkabber Crashes After Hitting "Alt-Any Key" In Main Window ===

source: [[Ткаббер ЧаВо/Глюки#Windows, дистрибутив от ActiveState &mdash; "падения" при нажатии Alt-любая кнопка в главном окне|Перейти к ответу]].
en_us: [[Tkabber FAQ/Glitches#Windows, ActiveState Tcl/Tk: Tkabber Crashes After Hitting "Alt-Any Key" In Main Window|Go to the answer]].

source: === Windows, дистрибутив от ActiveState &mdash; "падения" при открытии в фоне окна со смайликом ===
en_us: === Windows, ActiveState Tcl/Tk: Crashes When Opening In Background A Window With A Smilie ===

source: [[Ткаббер ЧаВо/Глюки#Windows, дистрибутив от ActiveState &mdash; "падения" при открытии в фоне окна со смайликом|Перейти к ответу]].
en_us: [[Tkabber FAQ/Glitches#Windows, ActiveState Tcl/Tk: Crashes When Opening In Background A Window With A Smilie|Go to the answer]].

source: === Фатальная ошибка в wish при запуске полноэкранных приложений под Windows ===
en_us: === Fatal Error In "wish" When Running Full Screen Programs Under Windows ===

source: [[Ткаббер ЧаВо/Глюки#Фатальная ошибка в wish при запуске полноэкранных приложений под Windows|Перейти к ответу]].
en_us: [[Tkabber FAQ/Glitches#Fatal Error In "wish" When Running Full Screen Programs Under Windows|Go to the answer]].

source: = А как мне...?
en_us: = How Do I...?

source: А тут будут освещаться некоторые нетривиальные хитрульки.
en_us: Here you can find some non-trivial tricks.

source: [[Ткаббер ЧаВо/Как мне...?]]
en_us: [[Tkabber FAQ/How Do I...?]]

source: == Настройка Ткаббера (Не найду файл config.tcl) ==
en_us: == Configuring Tkabber (Can't Find config.tcl) ==

source: [[Ткаббер ЧаВо/Как мне...?#Настройка Ткаббера (Не найду файл config.tcl)|Перейти к ответу]].
en_us: [[Tkabber FAQ/How Do I...?#Configuring Tkabber (Can't Find config.tcl)|Go to the answer]].

source: == Как настроить "автологин"?
en_us: == How To Set Up "Autologin"?

source: [[Ткаббер ЧаВо/Как мне...?#Как настроить "автологин"?|Перейти к ответу]].
en_us: [[Tkabber FAQ/How Do I...?#How To Set Up "Autologin"?|Go to the answer]].

source: == Работать с RSS ==
en_us: == Work With RSS? ==

source: [[Ткаббер ЧаВо/Как мне...?#Работать с RSS|Перейти к ответу]].
en_us: [[Tkabber FAQ/How Do I...?#Work With RSS?|Go to the answer]].

source: == Отправка сообщений по Ctrl-Enter ==
en_us: == Sending Messages By Ctrl-Enter ==

source: [[Ткаббер ЧаВо/Как мне...?#Отправка сообщений по Ctrl-Enter|Перейти к ответу]].
en_us: [[Tkabber FAQ/How Do I...?#Sending Messages By Ctrl-Enter|Go to the answer]].

source: == Отправка сообщений по NumPad Enter ==
en_us: == Sending Messages By NumPad Enter ==

source: [[Ткаббер ЧаВо/Как мне...?#Отправка сообщений по NumPad Enter|Перейти к ответу]].
en_us: [[Tkabber FAQ/How Do I...?#Sending Messages By NumPad Enter|Go to the answer]].

source: == Одновременная работа с несколькими аккаунтами ==
en_us: == Simultaneous Work With Several Accounts ==

source: [[Ткаббер ЧаВо/Как мне...?#Одновременная работа с несколькими аккаунтами|Перейти к ответу]].
en_us: [[Tkabber FAQ/How Do I...?#Simultaneous Work With Several Accounts|Go to the answer]].

source: == Как насчёт автозахода на конференции?
en_us: == How About Autojoining Conferences?

source: [[Ткаббер ЧаВо/Как мне...?#Как насчёт автозахода на конференции?|Перейти к ответу]].
en_us: [[Tkabber FAQ/How Do I...?#How About Autojoining Conferences?|Go to the answer]].

source: == Сжатие трафика в Ткаббере ==
en_us: == Traffic Compression In Tkabber ==

source: [[Ткаббер ЧаВо/Как мне...?#Сжатие трафика в Ткаббере|Перейти к ответу]].
en_us: [[Tkabber FAQ/How Do I...?#Traffic Compression In Tkabber|Go to the answer]].

source: == Выделение текста жирным, курсивом и подчёркиванием ==
en_us: == Text Formatting (Bold, Italics, Underscore) ==

source: [[Ткаббер ЧаВо/Как мне...?#Выделение текста жирным, курсивом и подчёркиванием|Перейти к ответу]].
en_us: [[Tkabber FAQ/How Do I...?#Text Formatting (Bold, Italics, Underscore)|Go to the answer]].

source: == Ввод "хитрых" юникодных символов ==
en_us: == Entering Of Some Unicode Characters ==

source: [[Ткаббер ЧаВо/Как мне...?#Ввод "хитрых" юникодных символов|Перейти к ответу]].
en_us: [[Tkabber FAQ/How Do I...?#Entering Of Some Unicode Characters|Go to the answer]].

source: == Игнор &mdash; великая вещь!
en_us: == Ignoring Rules!

source: [[Ткаббер ЧаВо/Как мне...?#Игнор — великая вещь!|Перейти к ответу]].
en_us: [[Tkabber FAQ/How Do I...?#Ignoring Rules!|Go to the answer]].

source: == Подтверждения ==
en_us: == Confirmations ==

source: [[Ткаббер ЧаВо/Как мне...?#Подтверждения|Перейти к ответу]].
en_us: [[Tkabber FAQ/How Do I...?#Confirmations|Go to the answer]].

source: == Удалённое управление ==
en_us: == Remote Control ==

source: [[Ткаббер ЧаВо/Как мне...?#Удалённое управление|Перейти к ответу]].
en_us: [[Tkabber FAQ/How Do I...?#Remote Control|Go to the answer]].

source: == Команды Ткаббера ==
en_us: == Tkabber Commands ==

source: [[Ткаббер ЧаВо/Как мне...?#Команды Ткаббера|Перейти к ответу]].
en_us: [[Tkabber FAQ/How Do I...?#Tkabber Commands|Go to the answer]].

source: == Скрытие версий клиента и ОС ==
en_us: == Client Version And OS Hiding ==

source: [[Ткаббер ЧаВо/Как мне...?#Скрытие версий клиента и ОС|Перейти к ответу]].
en_us: [[Tkabber FAQ/How Do I...?#Client Version And OS Hiding|Go to the answer]].

source: == Как подключить плагин?
en_us: == How To Connect A Plugin?

source: [[Ткаббер ЧаВо/Как мне...?#Как подключить плагин?|Перейти к ответу]].
en_us: [[Tkabber FAQ/How Do I...?#How To Connect A Plugin?|Go to the answer]].

source: == Как уменьшить трафик?
en_us: == How To Reduce Traffic?

source: [[Ткаббер ЧаВо/Как мне...?#Как уменьшить трафик?|Перейти к ответу]].
en_us: [[Tkabber FAQ/How Do I...?#How To Reduce Traffic?|Go to the answer]].

source: == Самостоятельная сборка Старпака ==
en_us: == How Can I Assemble A Starpack Myself? ==

source: [[Ткаббер ЧаВо/Как мне...?#Самостоятельная сборка Старпака|Перейти к ответу]].
en_us: [[Tkabber FAQ/How Do I...?#How Can I Assemble A Starpack Myself?|Go to the answer]].

source: == "Быстрый" Copy/Paste помимо буфера Windows ==
en_us: == "Rapid" Copy/Paste Without Using Windows Clipboard ==

source: [[Ткаббер ЧаВо/Как мне...?#"Быстрый" Copy/Paste помимо буфера Windows|Перейти к ответу]].
en_us: [[Tkabber FAQ/How Do I...?#"Rapid" Copy/Paste Without Using Windows Clipboard|Go to the answer]].

source: == Проверка орфографии ==
en_us: == Spellchecking ==

source: [[Ткаббер ЧаВо/Как мне...?#Проверка орфографии|Перейти к ответу]].
en_us: [[Tkabber FAQ/How Do I...?#Spellchecking|Go to the answer]].

source: == Как перенести ростер с сервера на сервер?
en_us: == How To Transfer My Roster From Server To Server?

source: Импортировать контакты ICQ?
en_us: How To Import ICQ Contacts?

source: [[Ткаббер ЧаВо/Как мне...?#Как перенести ростер с сервера на сервер?
en_us: [[Tkabber FAQ/How Do I...?#How To Transfer My Roster From Server To Server?

source: Импортировать контакты ICQ?|Перейти к ответу]].
en_us: How To Import ICQ Contacts?|Go to the answer]].

source: == Как почитать протокол общения "в привате" с участником групчата, которого больше нет в комнате?
en_us: == How To Read History Of A Private Chat With A User That Isn't In The Room Anymore?

source: [[Ткаббер ЧаВо/Как мне...?#Как почитать протокол общения "в привате" с участником групчата, которого больше нет в комнате?|Перейти к ответу]].
en_us: [[Tkabber FAQ/How Do I...?#How To Read History Of A Private Chat With A User That Isn't In The Room Anymore?|Go to the answer]].

source: == Указать причину кика/бана ==
en_us: == How To Provide Reason For A Kick/Ban? ==

source: [[Ткаббер ЧаВо/Как мне...?#Указать причину кика/бана|Перейти к ответу]].
en_us: [[Tkabber FAQ/How Do I...?#How To Provide Reason For A Kick/Ban?|Go to the answer]].

source: == Блокировать спам с MRIM-гейта ==
en_us: == Blocking Spam From MRIM Transport ==

source: [[Ткаббер ЧаВо/Как мне...?#Блокировать спам с MRIM-гейта|Перейти к ответу]].
en_us: [[Tkabber FAQ/How Do I...?#Blocking Spam From MRIM Transport|Go to the answer]].

source: == Конфигурирование конференции ==
en_us: == Conference Configuring ==

source: [[Ткаббер ЧаВо/Как мне...?#Конфигурирование конференции|Перейти к ответу]].
en_us: [[Tkabber FAQ/How Do I...?#Conference Configuring|Go to the answer]].

source: == Отключить к (нецензурные слова пропущены) splash-окно ==
en_us: == How To Turn Off Splash Window? ==

source: [[Ткаббер ЧаВо/Как мне...?#Отключить к (нецензурные слова пропущены) splash-окно|Перейти к ответу]].
en_us: [[Tkabber FAQ/How Do I...?#How To Turn Off Splash Window?|Go to the answer]].

source: == Подключить Ткаббер через SOCKS-сервер ==
en_us: == Connecting Via SOCKS Server ==

source: [[Ткаббер ЧаВо/Как мне...?#Подключить Ткаббер через SOCKS-сервер|Перейти к ответу]].
en_us: [[Tkabber FAQ/How Do I...?#Connecting Via SOCKS Server|Go to the answer]].

source: == Подключить Ткаббер через Tor, для анонимного использования ==
en_us: == How To Connect Tkabber Via Tor, For Anonymous Usage? ==

source: [[Ткаббер ЧаВо/Как мне...?#Подключить Ткаббер через Tor, для анонимного использования|Перейти к ответу]].
en_us: [[Tkabber FAQ/How Do I...?#How To Connect Tkabber Via Tor, For Anonymous Usage?|Go to the answer]].

source: == Подключиться к Google Talk ==
en_us: == Connecting To Google Talk ==

source: [[Ткаббер ЧаВо/Как мне...?#Подключиться к Google Talk|Перейти к ответу]].
en_us: [[Tkabber FAQ/How Do I...?#Connecting To Google Talk|Go to the answer]].

source: == Победить предупреждение о проблеме с сертификатом сервера?
en_us: == Disabling Warnings About Server Certificate Problem

source: [[Ткаббер ЧаВо/Как мне...?#Победить предупреждение о проблеме с сертификатом сервера|Перейти к ответу]].
en_us: [[Tkabber FAQ/How Do I...?#Disabling Warnings About Server Certificate Problem|Go to the answer]].

source: == Работать с версией из SVN ==
en_us: == How To Work With SVN Version Of Tkabber? ==

source: [[Ткаббер ЧаВо/Как мне...?#Работать с версией из SVN|Перейти к ответу]].
en_us: [[Tkabber FAQ/How Do I...?#How To Work With SVN Version Of Tkabber?|Go to the answer]].

source: == Задолбало выпадающее меню в контекстном меню MUC-юзера ==
en_us: == I'm Sick And Tired Of Drop-Down Menu In MUC-User Context Menu ==

source: [[Ткаббер ЧаВо/Как мне...?#Задолбало выпадающее меню в контекстном меню MUC-юзера|Перейти к ответу]].
en_us: [[Tkabber FAQ/How Do I...?#I'm Sick And Tired Of Drop-Down Menu In MUC-User Context Menu|Go to the answer]].

source: == Как мне собрать новый tclgpg с googlecode?
en_us: == How To Build New tclgpg From Googlecode?

source: [[Ткаббер ЧаВо/Как мне...?#Как мне собрать новый tclgpg с googlecode?|Перейти к ответу]].
en_us: [[Tkabber FAQ/How Do I...?#How To Build New tclgpg From Googlecode?|Go to the answer]].

source: == Как настроить работу с плагином OSD?
en_us: == How To Work With OSD Plugin?

source: [[Ткаббер ЧаВо/Как мне...?#Как настроить работу с плагином OSD?|Перейти к ответу]].
en_us: [[Tkabber FAQ/How Do I...?#How To Work With OSD Plugin?|Go to the answer]].

source: == Включить интерфейс на другом языке?
en_us: == How To Enable Interface In Another Language?

source: [[Ткаббер ЧаВо/Как мне...?#Включить другой язык интерфейса?|Перейти к ответу]].
en_us: [[Tkabber FAQ/How Do I...?#How To Enable Interface In Another Language?|Go to the answer]].

source: == Изменить и зафиксировать ширину ростера?
en_us: == How To Change And Save Roster Width?

source: [[Ткаббер ЧаВо/Как мне...?#Изменить и зафиксировать ширину ростера?|Перейти к ответу]].
en_us: [[Tkabber FAQ/How Do I...?#How To Change And Save Roster Width?|Go to the answer]].

source: = Всякая всячина =
en_us: = Miscellaneous =

source: [[Ткаббер ЧаВо/Разное]]
en_us: [[Tkabber FAQ/Misc]]

source: == Что такое...?
en_us: == What Is...?

source: === Ростер ===
en_us: === Roster ===

source: [[Ткаббер ЧаВо/Разное#Ростер|Перейти к ответу]].
en_us: [[Tkabber FAQ/Misc#Roster|Go to the answer]].

source: === Ресурс ===
en_us: === Resource ===

source: [[Ткаббер ЧаВо/Разное#Ресурс|Перейти к ответу]].
en_us: [[Tkabber FAQ/Misc#Resource|Go to the answer]].

source: === Приоритет ===
en_us: === Priority ===

source: [[Ткаббер ЧаВо/Разное#Приоритет|Перейти к ответу]].
en_us: [[Tkabber FAQ/Misc#Priority|Go to the answer]].

source: === Консоль Ткаббера ===
en_us: === Tkabber Console ===

source: [[Ткаббер ЧаВо/Разное#Консоль Ткаббера|Перейти к ответу]].
en_us: [[Tkabber FAQ/Misc#Tkabber Console|Go to the answer]].

source: === Репозиторий teo ===
en_us: === Teo's Repository ===

source: [[Ткаббер ЧаВо/Разное#Репозиторий teo|Перейти к ответу]].
en_us: [[Tkabber FAQ/Misc#Teo's Repository|Go to the answer]].

source: == Разное ==
en_us: == Misc ==

source: === ...а мне ИГРАТЬ охота!!!
en_us: === I'd Love Playing Games!

source: [[Ткаббер ЧаВо/Разное#...а мне ИГРАТЬ охота!!!|Перейти к ответу]].
en_us: [[Tkabber FAQ/Misc#I'd Love Playing Games!|Go to the answer]].

source: === Старые версии Ткаббера и плагинов ===
en_us: === Old Versions Of Tkabber And Its Plugins ===

source: [[Ткаббер ЧаВо/Разное#Старые версии Ткаббера и плагинов|Перейти к ответу]].
en_us: [[Tkabber FAQ/Misc#Old Versions Of Tkabber And Its Plugins|Go to the answer]].

source: === Работает ли Ткаббер на КПК?
en_us: === Does Tkabber Work On PDA?

source: [[Ткаббер ЧаВо/Разное#Работает ли Ткаббер на КПК?|Перейти к ответу]].
en_us: [[Tkabber FAQ/Misc#Does Tkabber Work On PDA?|Go to the answer]].

source: === Почему Ткаббер написан именно на Tcl/Tk?
en_us: === Why Tkabber Is Written In Tcl/Tk?

source: [[Ткаббер ЧаВо/Разное#Почему Ткаббер написан именно на Tcl/Tk?|Перейти к ответу]].
en_us: [[Tkabber FAQ/Misc#Why Tkabber Is Written In Tcl/Tk?|Go to the answer]].

source: === Кто убил Лору Палмер?
en_us: === Who Killed Lora Palmer?

source: [[Ткаббер ЧаВо/Разное#Кто убил Лору Палмер?
en_us: [[Tkabber FAQ/Misc#Who Killed Lora Palmer?

source: ©|Перейти к ответу]].
en_us: ©|Go to the answer]].

source: === У вас в конференции топик с ошибкой написан ===
en_us: === Your Conference Topic Contains A Grammar Error ===

source: [[Ткаббер ЧаВо/Разное#У вас в конференции топик с ошибкой написан|Перейти к ответу]].
en_us: [[Tkabber FAQ/Misc#Your Conference Topic Contains A Grammar Error|Go to the answer]].

source: === А добавят ли когда-нибудь в Ткаббер...?
en_us: === Will This Cool Feature Be Added To Tkabber Some Day?

source: [[Ткаббер ЧаВо/Разное#А добавят ли когда-нибудь в Ткаббер...?|Перейти к ответу]].
en_us: [[Tkabber FAQ/Misc#Will This Cool Feature Be Added To Tkabber Some Day?|Go to the answer]].

source: == Вопросы, связанные с протоколом XMPP ==
en_us: == Questions Related To XMPP ==

source: ==== Кто есть кто в конференции?
en_us: ==== Who Is Who In Multi-User Conference?

source: [[Ткаббер ЧаВо/Разное#Кто есть кто в конференции?|Перейти к ответу]].
en_us: [[Tkabber FAQ/Misc#Who Is Who In Multi-User Conference?|Go to the answer]].

source: ==== Не работают инвайты ====
en_us: ==== Invites Seem To Not Work ====

source: [[Ткаббер ЧаВо/Разное#Не работают инвайты|Перейти к ответу]].
en_us: [[Tkabber FAQ/Misc#Invites Seem To Not Work|Go to the answer]].

source: [[en:Tkabber FAQ/Glitches]]
en_us: [[ru:Ткаббер ЧаВо/Глюки]]

source: [[Ткаббер ЧаВо]] разделился на несколько статей.
en_us: [[Tkabber FAQ]] was divided into several articles.

source: В этой статье разбираются глюки и баги, терзающие Ткаббер и его пользователей.
en_us: This article is dedicated to bugs that trouble Tkabber and its users.

source: Для удобства даны ссылки на другие тематические страницы ЧаВо.
en_us: For more comfortable navigation there are links to other thematic FAQ pages.

source: '''Вопрос: Ткаббер жутко долго грузится.
en_us: '''Question: It takes Tkabber several minutes to start up.

source: Поначалу я даже думал, что он виснет на старте, но как-то раз набрался тепрения и дождался.
en_us: First I even thought that it hangs up when starting but one day I possessed my soul in patience and got Tkabber loaded.

source: Потом работает нормально.'''
en_us: Once it's loaded it works fine.'''

source: Ответ: Посмотрите внимательно, что при этом показывает прогресс-бар сплэш-скрина.
en_us: Answer: Look at the progress-bar of Tkabber splash-screen.

source: Если на нём застыли слова "пользовательский интерфейс", то возможно, дело вот в чём.
en_us: If the words "user interface" are frozen there, then maybe we know what happens.

source: Если у вас включено кэширование новостей, а самих новостных фидов в ростере &mdash; вагон и маленькая тележка, то через некоторое время общее число сообщений может с лёгкостью перевалить за несколько сотен.
en_us: If you have headlines caching enabled and have a lot of RSS feeds in the roster, especially some daily renewed ones, the total quantity of messages in the headlines tab can easily grow up to several hundreds.

source: Естественно, чтобы все их подгрузить из файла, требуется время.
en_us: Of course, to load all of them from a file takes some time.

source: Решений несколько:
en_us: There are several solutions:

source: # отключить кэширование, тогда при закрытии программы новости, которые вы не успели прочитать, пропадут;
en_us: # disable caching, then headlines you haven't read will be lost after closing Tkabber;

source: # избавиться от лишних очень активных фидов или хотя бы просматривать и удалять вручную большие списки новостей перед закрытием программы;
en_us: # get rid of unnecessary very active feeds or at least look through and clean big headline lists before closing the program; # consider installing some RSS-reader program: usually they work fast and have more RSS-specific features than Tkabber; if you use one, move the most annoying feeds there;

source: # смириться с долгой загрузкой или перегружаться как можно реже;
en_us: # put up with a long startup and restart Tkabber seldom;

source: # проапгрейдить компьютер;
en_us: # upgrade your hardware;

source: # оптимизировать код.
en_us: # optimize the code.

source: Выбирать вам :)
en_us: It's all up to you :)

source: '''Вопрос: Нажимаю "Подключиться" в окне логина и Ткаббер "подвисает"; соединение с сервером не происходит (или происходит, но после указанной паузы).
en_us: '''Question: I press the {{button|Log in}} button in the Login window and Tkabber "hangs up": it either cannot connect to a server at all, or connects after a long pause.

source: Что делать?'''
en_us: What can I do?'''

source: Ответ: Если исключить очень плохое качество связи, которое бывает, например, на GPRS-линках, причин обычно две, и обе они коренятся в том, что Ткаббер в ходе соединения с сервером выполняет запросы к [http://en.wikipedia.org/wiki/DNS DNS].
en_us: Answer: In addition to a low quality connection (GPRS in Russia, for example), there are two main causes of this. Both of them arise from the fact that Tkabber makes [http://en.wikipedia.org/wiki/DNS DNS-requests] while connecting to a jabber-server.

source: [[Ткаббер и DNS|Эта статья]] подробно описывает возможные проблемы с DNS в Ткаббере и методы их решения.
en_us: [[Tkabber and DNS|This article]] gives a broad description of problems with DNS in Tkabber and helps with shooting these troubles.

source: '''Вопрос: Так работает в Ткаббере пересылка файлов или нет?
en_us: '''Question: So does file transfer work or not in Tkabber?

source: Мы с другом пробовали сто раз через все доступные протоколы, и ничего не шлётся.'''
en_us: My friends and I have tried all options in different ways but nothing helps.'''

source: Ответ: Для начала почитайте '''[[Пересылка файлов: теория|введение]],''' также в сжатой форме это объяснено в официальной документации Ткаббера (разделы 4.2.12.&nbsp;The Stream Initiation Module и 4.2.13.&nbsp;The Jidlink Module):
en_us: Answer: First of all read [[File Transfer: Theory|some theory]]. It's also explained shortly in the official Tkabber documentation (chapters 4.2.12.&nbsp;The Stream Initiation Module and 4.2.13.&nbsp;The Jidlink Module):

source: Практическая же реализация (для большинства, но <em>не всех</em> случаев) такова.
en_us: Applying the theory one can do the following (these settings are appropriate for most, but <em>not all</em> cases):

source: Зайдите в '''Настройки &rarr; File Transfer''' и затем по очереди в '''Jidlink''' и '''SI'''.
en_us: Go to '''Tkabber &rarr; Customize &rarr; File Transfer''' and then visit '''Jidlink''' and '''SI'''.

source: В Jidlink включите опцию
en_us: In Jidlink enable

source: и отключите
en_us: and disable

source: оставив '''::jidlink::transport(allowed,dtcp-active)''' и '''::jidlink::transport(allowed,inband-bytestream)'''.
en_us: leaving as is '''::jidlink::transport(allowed,dtcp-active)''' and '''::jidlink::transport(allowed,inband-bytestream)'''.

source: В SI отключите
en_us: In SI disable

source: и оставьте
en_us: and leave

source: Не забудьте сохранить каждую изменяемую опцию для следующих сессий.
en_us: Do not forget to save every changed option for current and future sessions.

source: Если всё равно не работает, перечитайте ещё раз теорию (ссылка в начале ответа).
en_us: If file transfer still doesn't work, read the article about it once more.

source: '''Вопрос: Запускаю Ткаббер и он тут же переходит в состояние "отошёл".
en_us: '''Question: I start Tkabber and it instantly goes "away".

source: Установка руками любого другого статуса тут же обратно меняется Ткаббером на всё тот же "отошёл".
en_us: When I put some other status manually, Tkabber instantly changes it to "away".

source: Ответ: Причина проста &mdash; начиная с версии 0.9.8 в настройках Ткаббера поменялся формат времени, задаваемого для запуска Autoaway.
en_us: Answer: The cause of this strange behaviour is simple: in the version 0.9.8 of Tkabber the Autoaway time format was changed.

source: В версиях Ткаббера до 0.9.7 включительно время неактивности пользователя до перехода в состояния "отошёл" и "отошёл давно" задавалось в миллисекундах (стандартная единица измерения временных промежутков для тикля).
en_us: In Tkabber 0.9.7 and earlier values in milliseconds were used for automatic switching to "away" and "extended away" status (ms is a standard Tcl "time quant").

source: Начиная с версии 0.9.8 эти интервалы начали задаваться в более логичных единицах измерения &mdash; минутах.
en_us: Tkabber 0.9.8 was intented to be more user friendly, and the measurement unit of the autoaway timeout was changed to minute.

source: То есть "новые" версии Ткаббера умножают эти временные интервалы на 60000, чтобы перевести минуты в "тиклевые" миллисекунды.
en_us: I.e., new versions of Tkabber multiply the user defined value by 60000 to translate it into Tcl-understandable milliseconds.

source: Если происходит неприятность &mdash; Ткаббер версии >= 0.9.8 запускается с файлом конфигурации от версии <= 0.9.7, &mdash; заданные в конфигурации миллисекунды переводятся... в миллисекунды!
en_us: If you start Tkabber >= 0.9.8 with an old config <= 0.9.7, then milliseconds are converted to... milliseconds!

source: Получаются огромные числа, переполняющие 32-битное целое со знаком, и Ткаббер начинает считать, что получившийся интервал времени истёк.
en_us: As a result, Tkabber gets huge numbers that overflow 32-bit signed integer and thinks that timeout is already over.

source: Иллюстрация (можете повторить сами в консоли Ткаббера, wish или в tkcon):
en_us: A little example (you can repeat it in Tkabber console, {{program|wish}} or {{program|tkcon}}):

source: То есть, при тайм-ауте в одну минуту всё бы было хорошо, но как только мы ставим две минуты, появляется ошибка.
en_us: 1 minute timeout would be Ok but as soon as we put 2 minutes we get the error.
